#include <stdio.h>

int main(int argc, char const *argv[])
{
    unsigned int v = 47533;  // 1011 1001 1010 1101

    for (int i = 0; i < 4; i++)
    {
        unsigned int AND = v & 15;
        
        printf("%d\n", AND);
        v = v >> 4;
    }
    return 0;
}

/*
「論理積演算 (AND演算)」を使用する

x & y = AND
0 & 0 =  0
1 & 0 =  0
0 & 1 =  0
1 & 1 =  1

☆考え方☆

1) 1011 1001 1010 1101 (47533) & 0000 0000 0000 1111 (15) = 0000 0000 0000 1101 (13) → int型で出力 → 変数vを右に4bit分シフトする

2) 1011 1001 1010 (2970) & 0000 0000 1111 (15) = 0000 0000 1010 (10) → int型で出力 → 変数vを右に4bit分シフトする

3) 1011 1001 (185) & 0000 1111 (15) = 0000 1001 (9) → int型で出力 → 変数vを右に4bit分シフトする

4) 1011 (11) & 1111 (15) = 1011 (11) → int型で出力 (for文終了)
*/
